{
    "australia": "A dark blue flag with the flag of the United Kingdom in the top left quadrant, a seven pointed star in the bottom left quadrant, and five white stars on the right side of the flag in the formation of the Southern Cross constellation.",
    "new zealand": "A dark blue flag with the flag of the United Kingdom in the top left quadrant and four red stars on the right side of the flag in the formation of the Southern Cross constellation.",
    "france": "Three vertical stripes which from left to right are blue, white and red.",
    "russia": "Three horizontal stripes which from top to bottom are white, blue and red.",
    "switzerland": "A red square flag with a white cross in the centre.",
    "united kingdom": "Overlaid upright and diagonal crosses in red with white borders, on a dark blue background.",
    "united states of america": "Thirteen horizontal stripes, alternating between red and white, with a dark blue square in the top left quadrant featuring 50 white stars.",
    "canada": "Three equal vertical partitions which are red, white, red, with a red maple leaf in the central white partition.",
    "mexico": "Three vertical stripes which left to right are dark green, white, and red, with a coat of arms in the center featuring an eagle eating a snake.",
    "panama": "This flag is divided into four quadants. The top left is white with a blue star, the top right is solid red, the bottom left is solid blue, and the bottom right is white with a red star.",
    "cuba": "Five horizontal stripes alternating dark blue and white. These are overlaid with a red triangle extending from the left edge of the flag which has a white star in the center.",
    "costa rica": "Five horizontal stripes which from top to bottom are dark blue, white, red, white, dark blue, with the middle red band being wider than the others and featuring a coat of arms offset left from center featuring a sailing ship",
    "guatemala": "three vertical partitions which are light blue, white, light blue. In the center is a coat of arms with a scroll featuring the date of independence surrounded by an olive wreath, with crossed rifles underneath and a bird perched on top",
    "dominican republic": "A white cross separating the flag into four quadrants, with the top left and bottom right quadrants being dark blue, and the top right and bottom left quadrants being red. The coat of arms in the middle of the cross features a shield with the same colour quadrants as the larger flag",
    "Jamaica": "A yellow diagonal cross from corner to corner, splitting the flag into a left and right black triangle, and a top and bottom green triangle.",
    "bahamas": "Three horizontal stripes that from top to bottom and blue, yellow, blue, overlaid from the left edge with a black triangle.",
    "Nicaragua": "Three horizontal stripes which from top to bottom are bight blue, white, bright blue, with a triangular coat of arms in the center featuring green mountains over a blue sky.",
    "Haiti": "Top half is blue, bottom half is red, with a coat of arms in the middle. The coat of arms depicts a trophy of weapons atop a green hill, and a palm tree.",
    "Honduras": "three horizontal stripes which from top to bottom are light blue, white, light blue, with 5 light blue stars in the middle",
    "barbados": "Three vertical stripes which are dark blue, yellow, dark blue, with a black trident in the middle yellow partition",
    "el salvador": "Three horizontal stripes which are blue, white, blue, with the coat of arms in the center surrounded by circular yellow writing stating the name and location of the country",
    "saint lucia": "A light blue flag with black triangle in the center overlaid with a smaller yellow triangle",
    "grenada": "This flag is split diagonally into 4 triangles. The top and bottom triangles are yellow, while the left and right triangles are green. The whole flag has a thick red border and around the edgesm and 7 yellow stars. Three stars are in the top border edges, three in the bottom border red, and on in the middle of the flag embadded in a red circle.",
    "dominica": "A green flag with a tri-colour cross that is yellow, black and white, connecting the vertical and horizontal edges. In the center is a red circle with ten black stars and a parrot.",
    "antigua and barbuda": "A red flag split by a triangle extending from the top edge down to the middle of the lower edge. This triagnle features a setting sun against a black sky, over a band of blue water, with white at the point",
    "saint Kitts and Nevis": "A black stripe extends from the top right to bottom left corners with yellow edges and two white stars. The top left triangular flag section is green, while the bottom right section is red",
    "saint vincent and the grenadines": "Three vertical sections that left to right are blue, yellow, green with the middle section being the larger than the other two. In the center are three green diamonds in a V shape",
    "trinidad and tobago": "A red flag with a black stripe extending from the top left to bottom right corners with a white border."
}
